// 소수임을 판단하는 부울값이 들어가는 변수를 선언
var primeFlag;

// 소수는 1과 자신으로만 나눠지는 숫자이기 때문에 2부터 시작합니다.
// 2 부터 100까지 for 문을 써서 차례대로 검사합니다.
for(var i=2; i<=100; i++){
	// 모든 숫자는 일단은 소수라고 가정합니다. 뒤에 검사를 통해서 소수가 아닌 숫자를 제외합니다.
	primeFlag=true;
	
	// 2 부터 검사하는 숫자(i) 보다 작은 숫자까지 나머지 연산을 위해 for 문을 사용한다.
	for(var j=2; j<i; j++){
		// 만일 감사하는 숫자(i) 와 나누는 숫자 j의 나머지 연산이 0 이면 나눠진다는 의미로 소수가 아니다.
		if(i%j == 0){
			// 나머지가 0이면(나눠지면) 소수가 아니므로 변수 primeFlag를 false로 바꾼다.
			primeFlag = false;
			// 한 번이라도 나눠지는 숫자가 나타나면 소수가 아니므로 더이상 검사할 필요가 없다.
			// break 문을 사용하여 내부 for문을 벗어난다.
			break;
		}
	}
	
	// 변수 primeFlag가 true면 소수이고 false이면 소수가 아니다.
	// 소수인 숫자는 출력한다.
	if(primeFlag) {
		document.writeln(i+", ");
	}
}